package CIP;

public class Task3 {
/*
 * Определить иерархию фигур:
* Фигура, 
* Прямоугольник, Трапеция, Параллелограмм, Квадрат, Ромб, 
* Треугольник, Равносторонний треугольник,
* Эллипс, Окружность.

* Все фигуры должны содержать методы:
* 1) вывода на экран;
* 2) перемещения;
* 3) масштабирования.

* Создать контейнер для хранения фигур.

* Контейнер должен содержать методы:
* 1) вывода на экран содержимого;
* 2) перемещения всех фигур на величину (dx, dy);
* 3) масштабирования;
* 4) сложения с другим контейнером
 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
